БухЭксп/InformationRegisters/CW_ОтсутствующиеОригиналыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ОтсутствующиеОригиналыДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоПриобретениям</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РеализацияПрочихТоваровУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ОтсутствующиеОригиналыДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
//Обновление
Процедура ЗаполнитьИзмерениеВидДоговора() ЭКспорт
	
	Набор = РегистрыСведений.CW_ОтсутствующиеОригиналыДокументов.СоздатьНаборЗаписей();
	Набор.Прочитать();
	
	Для Каждого СтрокаНабора из Набор Цикл
		Если ЗначениеЗаполнено(СтрокаНабора.Договор) Тогда
			СтрокаНабора.ВидДоговора = СтрокаНабора.Договор.ВидДоговора;
		КонецЕсли;
	КонецЦикла;
	
	Набор.Записать(Истина);
	
КонецПроцедуры
//Обновление


Процедура ЗаписатьОтсутствующиеОригиналыДокументов(СтруктураПараметров) Экспорт	
	
	//Отсутствующие оригиналы документов
	НаборЗаписей = РегистрыСведений.CW_ОтсутствующиеОригиналыДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Значение 		= СтруктураПараметров.Ссылка;
	НаборЗаписей.Отбор.Документ.Использование 	= Истина;
	НаборЗаписей.Очистить();
	
	Если НЕ СтруктураПараметров.Признак Тогда
		Запись = НаборЗаписей.Добавить();
		Запись.Документ 	= СтруктураПараметров.Ссылка;
		Запись.Организация 	= СтруктураПараметров.Организация;
		Запись.Контрагент 	= СтруктураПараметров.Контрагент;
		Запись.Договор 		= СтруктураПараметров.Договор;
		Запись.ВидДоговора  = СтруктураПараметров.Договор.ВидДоговора;
	КонецЕсли; 
	
	НаборЗаписей.Записать(Истина);

КонецПроцедуры

#КонецЕсли
